api/controllers/RepositoryController.php

SELECT COUNT(id) FROM `repo` WHERE `q`='ruby'
---



        /*return new ActiveDataProvider([
            'query' => Repo::find(),
        ]);*/