api/models/User.php

    public static function findIdentityByAccessToken($token, $type = null) {
        return static::find()
            ->where(['id' => (string) $token->getClaim('urf_userID') ])
            ->andWhere(['<>', 'status', '10'])
            ->one();
---
SELECT * FROM `user` WHERE (`id`='1') AND (`status` <> '10')